{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, null, 27], "dtype": "float32", "sparse": false, "ragged": false, "name": "new_decoder_inputs"}, "name": "new_decoder_inputs", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "new_decoder_lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": true, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 1}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 3}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "new_decoder_lstm", "inbound_nodes": [[["new_decoder_inputs", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "new_decoder_dense", "trainable": true, "dtype": "float32", "units": 27, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "new_decoder_dense", "inbound_nodes": [[["new_decoder_lstm", 0, 0, {}]]]}], "input_layers": [["new_decoder_inputs", 0, 0]], "output_layers": [["new_decoder_dense", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "new_decoder_dense/kernel", "shape": [128, 27], "dtype": "float32"}, {"name": "new_decoder_dense/bias", "shape": [27], "dtype": "float32"}, {"name": "new_decoder_lstm/lstm_cell_2/kernel", "shape": [27, 512], "dtype": "float32"}, {"name": "new_decoder_lstm/lstm_cell_2/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "new_decoder_lstm/lstm_cell_2/bias", "shape": [512], "dtype": "float32"}]}]}